[{"id":0,"name":"blogEntry0","image":"https://palmtreedev.com/images/blogPost0.jpg","title":"My Experience with COVID-19","date":"2020-07-31T22:45:00.000Z","content":"When COVID-19 first arrived in my newsfeed, I initially thought nothing of it. It would be just another swine flu panic, and maybe similar to the actions taken against the SARS pandemic in 2003. I think that I can speak for a lot of people when I say that I wasn’t prepared. I remember being in my hotel room in Seattle, WA for spring break when I heard that universities around the United States were closing down the remainder of their spring semester; one by one, they were getting closer and closer to State College. Finally, as I received the news that “Penn State University would be moving classes to online lectures”, I understood how much my life, and the lives of billions would change.!n  While those billions of lives can be seen through statistics and news stories, I thought it best to talk about my own life and how my life has changed. First, I’d like to point out how incredibly lucky I was when the pandemic tore through my country. As a student of Penn State, I had to abide by their rules and regulations. During the breakout, Penn State University ruled that students who reside on campus would not be able to return to their residence halls, except for very limited emergencies (medicine, legal documents, etc.). They also recommended that all apartment buildings in the surrounding area urge students to leave and quarantine themselves in their home away from the university. At the time, I was living in one of those apartments with my partner.!n I often think about the students living in the dorms that left for spring break, leaving their clothes, computers, and other precious belongings with the mindset that they would be back in a week. In fact, it would take months before they would be allowed to move out in June. For thousands of others, I thought about their graduation. Graduating from college would be the only thing that motivated them though those all-nighters, study sessions, and hundreds of papers. I could never imagine the disappointment as they hear that they would be graduating through a Zoom video conference.!n Once I returned from my trip, living in State College was strange. The campus, typically crowded with students and professors, were entirely empty. Grocery stores around town were filled with mostly locals, and international students who were quarantined out of their own country. For the first few weeks, quarantine was easy. The routine consisted of working my part time web development job every morning, taking the dogs to the outdoor dog park every day, and grocery shopping once a week. It was difficult to say the least. We quickly ran out of movies, TV shows, and video games to keep us entertained for the time being.!n Eventually, we found ourselves settling into hobbies. For me, working on this website became a lengthy project that I found myself enjoying more than I thought I would. For my partner, sewing, video games, and other overly complicated and time-consuming crafts. Amazingly, all of this lasted until I could move out of my dorm in June. Once I was moved out, we began the process of moving out of my partner’s apartment and left for our homes. There, we continued our quarantine.!n  As of today, the virus is still violently charging through the United States, and the light at the end of the tunnel seems to be only getting smaller. However, everyday I’m reminded how lucky I am to be healthy, safe, and cared for. The worst may be yet to come, but I’ll always keep my head up high and roll with the punches as they come, and they will.!n"},{"id":1,"name":"blogEntry1","image":"https://palmtreedev.com/images/blogPost1.jpg","title":"How to Become a Runner","date":"2020-09-08T22:41:00.000Z","content":"25 lbs. That’s how much weight I gained during my freshman year of college. I mean, it makes sense, looking back on it. Food was always a source of comfort for me. The only reason I wasn’t gaining weight like that before college was because of the high school swim team, where I trained for 2 hours a day, 6 days a week, for 4 years straight. During that time, I was burning an excess of well over 1,500 calories per practice. After graduation and my last summer swim session, all of that stopped. Of course, I thought it was the greatest feeling in the world. It was the same feeling I used to get when school let out for summer. I was free…so I thought.!n Fast forward to the end of my first year in college. Walking to class was taking more of a toll than it ever has. ‘Since when has walking been tiring’ I thought to myself. That’s when it began to hit me, I was obese. At 233 lbs, I was 11 pounds above the obesity marker for my height. Never in my life did I ever think that this could happen to me. I had to do something. I tried to swim again, with no avail. The college pool hours were far too narrow for my class schedule, and when I moved home again, I wouldn’t have an easy access to a lap pool. After a lot of thought, I decided that I would have to bite the bullet and run. Running wasn’t something I was exactly unfamiliar with. My parents have been avid runners since the day I was born, and swim practices often included running workouts during dry-land sessions. However, I had never ran for more than a mile at a time and it was safe to say that getting started wouldn’t be easy and had to start somewhere. So while I had the motivation and excitement in my body, I threw on a pair of athletic shoes, shorts, t-shirt, and went for my first run on February 20th, 2017.!n My first week of running felt very familiar. Losing my wind, sweating a lot, and going way too fast. I was only able to achieve about 9:30 pace for a mile-and-a-half. My feet hurt, my entire body was chafing, and I didn’t feel like I was making any progress. I had almost no motivation to go any further, other than my weight. So, I decided to push a little bit of tough love on myself. I enrolled myself into a running plan that would train me to run a half marathon over the course of 7 months. It was a big stretch from the mile-and-a-half I had been running, but I had to give myself a goal to work towards. From there, it was as easy as following the plan and grinding out those miles.!n  Every extra mile, I found, brought a new set of challenges. After I surpassed 3 miles, my feet started to go numb. That’s how I learned about the value of good running shoes. After 4 miles, I learned about leg chafing and the importance of good running shorts/underwear. After 5 miles, I learned about the pain of shin splints and how to overcome and work through them. After 6 miles, I learned about the importance of recovery and stretching after a long workout. Then, every consecutive mile gained after that was all mental. The importance of music, trails, the time of day you run, and especially, the temperature.!n  While I began running in February 2017, a majority of my running was done in the summer. During that time, I learned the brutal truth about what heat and humidity can do to a runner. It can make it feel like you’re running in an oven some days, and a swamp the next day. I found myself only able to finish half of my workout, or completely exhaust myself by the end, with a less than satisfying pace. But, 3 months later, the temperature cooled down, and I was back on my pace. As the half marathon came closer, I trained harder and harder to prepare, researching nutrition info, strategies marathon runners use, and even what music to listen to while I run. But when race day came, there was nothing more I could do.!n  The run itself was nothing special. There were no crowds, no signs, not even any other runners. It was a personal, timed, goal for myself to finish a half marathon. The reward itself wasn’t a metal, or a congratulations from friends, it was the feeling of accomplishment and proving to myself that I can do anything if I work hard at it. I had always heard that line before and cringed at how typical it sounded, but after I heard my watch sound off at the 13.11 mile mark, it was the best feeling I had felt in a very long time.!n Since then, I’ve still been an avid runner. However, surgery had forced my running to come to a stop for about 2 years. It was only recently that I had been given the clearance to run again. Starting at the humble length of about 3 miles, I had to work myself back into shape. I’m using the same schedule, routine, and strategies that I had used in 2017, and I plan to run a half marathon again in September.!n"},{"id":2,"name":"blogEntry2","image":"https://palmtreedev.com/images/blogPost2.jpg","title":"Road Trip 2020","date":"2020-09-25T19:05:00.000Z","content":"Road trips are not as fun and easy as they seem in the movies, as I found this out fairly recently. A few weeks ago, me and my partner made the long journey from Washington DC to Portland, OR. In total, the entire drive would be forty-three hours, spread across five days of driving. At the time of this decision, it didn’t seem like it would be that bad. I had gone on several long trips before, and had little to no trouble. For college, I would often have to drive four hours to get from campus to home and back to campus again. Beyond that, people dream of going on road trips across the United States. I remember, specifically, my dad telling me how jealous he was, considering he had been all over the world, but had never traveled deep into the US. Well dad, I’m happy to announce that you’re not missing much.!n The start of the road trip was very positive, as they often are. I had not seen my partner for several weeks, so we were happy to reconnect and experience this trip together. We had brough snack food, a book, and several podcasts for us to listen to for our journey. The book itself, was a guide book I had gotten as a going-away gift. I read most of it aloud with Emily, talking about restaurants we would love to visit, trails we could hike, theaters we could see, etc. After finishing the book, we realized we were only three hours in. That would only a be a third of the driving we were doing that day. It was then I understood that I had drastically underestimated how long this trip would take.!n I think that now would also be a good time to mention that we were also bringing along two dogs. Our adorable pooches sat in the back seat of my Kia Sorento, most often sleeping, less often crying anytime we slowed down below forty miles per hour. This is because they thought we would be stopping to let them out. Typically, they were correct. Every few hours, we would stop to stretch our legs, let the pups out, get food, and, most importantly, get gas. Surprisingly, bringing along two dogs proved to be incredibly easy (results may vary). Their stress levels were incredibly low; however, I think its only because they had absolutely no idea what was going on. Even now, I still don’t think they quite understand how far away they are from home.!n Anyway, with the two dogs in the back, we made our first stop in Indiana. The hotel was nice, but the bed was even nicer. I didn’t think that driving and sitting all day could make you so tired. Maybe it’s the stress and anxiety of going eighty miles per hour on the highway for nine hours that really wares me down. Either way, the afternoons were significantly better than the mornings. Because the next morning, it was bright and early at five a.m. as we were getting on the road again for another nine hours. This time, our destination was Nebraska.!n  I think was really took me by surprise was the amount of farmland I saw. I often saw miles and miles of crops before seeing a single farmhouse and thinking to myself, ‘someone really owns all of this’. Being from the suburban east coast, I had very little idea what a real rural area looked like. After seeing it firsthand, I have a whole new appreciation for farmers. Beyond that, I also gained a new insight as to how flat a land can be. Where I’m from, it was considered a beautiful view if you could see out a for a couple miles. On the road trip, the only thing limiting my view was the eventual air pollution that came in maybe fifty miles away. Never had I ever seen more “nothing” in my life.!n  While you’d think this would make the road trip more boring, it actually made it far more exciting. This was the furthest away from home I had ever been (not counting flying to Portland for a few days). Every mile was a mile I hadn’t ever seen before outside of movies and pictures. Every new mountain or rock formation that came up out of the ground was beautiful to me. Bringing along my film camera was one of the best decisions I could have made. That became especially apparent as we approached the west coast. Mountains, pine forests, and lakes approached us, one after the other. It almost felt like all of our hard work and driving was being paid off with the view alone. It felt like the entire road trip had been worth it. I felt at home.!n"}]